pr1_5/src/Documents/Sales/Sales.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Sales</name>
  <attributes>
    <name>TotalSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Products</name>
    <attributes>
      <name>Product</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Cost</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

pr1_5/src/Documents/Sales/Forms/DocumentForm/Module.bsl
&НаКлиенте
Процедура ProductsAmountПриИзменении(Элемент)
	Объект.TotalSum = 0;        
	Для каждого СтрокаДокумента Из Объект.Products Цикл
		СтрокаДокумента.Sum = СтрокаДокумента.Amount * СтрокаДокумента.Cost;
    	Объект.TotalSum = Объект.TotalSum + (СтрокаДокумента.Sum);
	КонецЦикла;
КонецПроцедуры
